irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_exti_2563_IUT.c
  CS_CMM_PROBE_NODE_STMT(66,4,0) ((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->IMR = 0x00000000;
  ((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->EMR = 0x00000000;
  ((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->RTSR = 0x00000000;
  ((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->FTSR = 0x00000000;
  ((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->PR = 0x000FFFFF;

CS_CMM_PROBE_NODE_STMT(66,3,1) 
 CODESCROLL_FUNC_END(118, 10, 91) } CODESCROLL_FUNC_END_RBRACE 
/* # 100 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_exti.c"*/
void EXTI_Init(EXTI_InitTypeDef* EXTI_InitStruct)
{ CODESCROLL_FUNC_BEGIN(119, (119, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable316,313) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable317,66,2,0)

  uint32_t tmp = 0;


  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);

  tmp = (uint32_t)((((uint32_t)0x40000000) + 0x10000) + 0x0400);

  
  CS_CMM_PROBE_NODE_STMT(66,1,1) if (EXTI_InitStruct->EXTI_LineCmd != DISABLE)
  {

    
    CS_CMM_PROBE_NODE_STMT(66,0,2) ((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->IMR &= ~EXTI_InitStruct->EXTI_Line;
    ((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->EMR &= ~EXTI_InitStruct->EXTI_Line;

    tmp += EXTI_InitStruct->EXTI_Mode;

    *(volatile uint32_t *) tmp |= EXTI_InitStruct->EXTI_Line;


    ((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->RTSR &= ~EXTI_InitStruct->EXTI_Line;
    ((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->FTSR &= ~EXTI_InitStruct->EXTI_Line;


    
    CS_CMM_PROBE_NODE_STMT(67,7,3) if (EXTI_InitStruct->EXTI_Trigger == EXTI_Trigger_Rising_Falling)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable318,314) 

      
      CS_CMM_PROBE_NODE_STMT(67,6,4) ((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->RTSR |= EXTI_InitStruct->EXTI_Line;
      ((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->FTSR |= EXTI_InitStruct->EXTI_Line;
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable319,315) 
      
      CS_CMM_PROBE_NODE_STMT(67,5,5) tmp = (uint32_t)((((uint32_t)0x40000000) + 0x10000) + 0x0400);
      tmp += EXTI_InitStruct->EXTI_Trigger;

      *(volatile uint32_t *) tmp |= EXTI_InitStruct->EXTI_Line;
    }
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable320,316) 
    
    CS_CMM_PROBE_NODE_STMT(67,4,6) tmp += EXTI_InitStruct->EXTI_Mode;


    *(volatile uint32_t *) tmp &= ~EXTI_InitStruct->EXTI_Line;
  }

CS_CMM_PROBE_NODE_STMT(67,3,7) 
 CODESCROLL_FUNC_END(119, 10, 148) } CODESCROLL_FUNC_END_RBRACE 







void EXTI_StructInit(EXTI_InitTypeDef* EXTI_InitStruct)
{ CODESCROLL_FUNC_BEGIN(120, (120, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable321,317) 
  
  CS_CMM_PROBE_NODE_STMT(67,2,0) EXTI_InitStruct->EXTI_Line = ((uint32_t)0x00000);
  EXTI_InitStruct->EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStruct->EXTI_Trigger = EXTI_Trigger_Falling;
  EXTI_InitStruct->EXTI_LineCmd = DISABLE;

CS_CMM_PROBE_NODE_STMT(67,1,1) 
 CODESCROLL_FUNC_END(120, 10, 162) } CODESCROLL_FUNC_END_RBRACE 







void EXTI_GenerateSWInterrupt(uint32_t EXTI_Line)
{ CODESCROLL_FUNC_BEGIN(121, (121, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable322,318) 

  
  CS_CMM_PROBE_NODE_STMT(67,0,0) ((void)0);

  ((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->SWIER |= EXTI_Line;

CS_CMM_PROBE_NODE_STMT(68,7,1) 
 CODESCROLL_FUNC_END(121, 10, 176) } CODESCROLL_FUNC_END_RBRACE 
/* # 185 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_exti.c"*/
FlagStatus EXTI_GetFlagStatus(uint32_t EXTI_Line)
{ CODESCROLL_FUNC_BEGIN(122, (122, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable323,319) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable324,68,6,0)

  FlagStatus bitstatus = RESET;

  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(68,5,1) if ((((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->PR & EXTI_Line) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable325,320) 
    
    CS_CMM_PROBE_NODE_STMT(68,4,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable326,321) 
    
    CS_CMM_PROBE_NODE_STMT(68,3,3) bitstatus = RESET;
  }
  
  CS_CMM_PROBE_NODE_STMT(68,2,4) 
   CODESCROLL_FUNC_END(122, 10, 199) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 







void EXTI_ClearFlag(uint32_t EXTI_Line)
{ CODESCROLL_FUNC_BEGIN(123, (123, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable327,322) 

  
  CS_CMM_PROBE_NODE_STMT(68,1,0) ((void)0);

  ((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->PR = EXTI_Line;

CS_CMM_PROBE_NODE_STMT(68,0,1) 
 CODESCROLL_FUNC_END(123, 10, 214) } CODESCROLL_FUNC_END_RBRACE 
/* # 223 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_exti.c"*/
ITStatus EXTI_GetITStatus(uint32_t EXTI_Line)
{ CODESCROLL_FUNC_BEGIN(124, (124, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable328,323) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable329,69,7,0)

  ITStatus bitstatus = RESET;
  uint32_t enablestatus = 0;

  ((void)0);

  enablestatus = ((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->IMR & EXTI_Line;
  
  CS_CMM_PROBE_NODE_STMT(69,6,1) if (CS_MCDC_124_0(((((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->PR & EXTI_Line) != (uint32_t)RESET), (enablestatus != (uint32_t)RESET), 15))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable330,10) 
    
    CS_CMM_PROBE_NODE_STMT(69,5,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable331,11) 
    
    CS_CMM_PROBE_NODE_STMT(69,4,3) bitstatus = RESET;
  }
  
  CS_CMM_PROBE_NODE_STMT(69,3,4) 
   CODESCROLL_FUNC_END(124, 10, 239) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 







void EXTI_ClearITPendingBit(uint32_t EXTI_Line)
{ CODESCROLL_FUNC_BEGIN(125, (125, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable332,324) 

  
  CS_CMM_PROBE_NODE_STMT(69,2,0) ((void)0);

  ((EXTI_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0400))->PR = EXTI_Line;

CS_CMM_PROBE_NODE_STMT(69,1,1) 
 CODESCROLL_FUNC_END(125, 10, 254) } CODESCROLL_FUNC_END_RBRACE 
